Revit 2027 API
Blend.GetVertexConnectionMap Method
Gets the mapping between the vertices in the top and bottom profiles.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexIndexPairArray GetVertexConnectionMap()
Public Function GetVertexConnectionMap As VertexIndexPairArray
public:
VertexIndexPairArray^ GetVertexConnectionMap()
member GetVertexConnectionMap : unit -> VertexIndexPairArray
Return Value
VertexIndexPairArray
Remarks
Each vertex refers to the start point of the curve from the top and bottom profiles.
See Also
Reference
Blend Class
Autodesk.Revit.DB Namespace